# GetHookOrientationAngle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarFreeFormAccessor..::..GetHookOrientationAngle Method
RebarFreeFormAccessor Class See Also
---
Get the hook orientation angle at end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double GetHookOrientationAngle(
	int end
)
```

Visual Basic
---
```text
Public Function GetHookOrientationAngle ( _
	end As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetHookOrientationAngle(
	int end
)
```

# ### Parameters
end
    Type: System..::..Int32 The end of bar. Should be 0 for start or 1 for end.
# ### Return Value
The hook orientation angle at end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Invalid end. |

# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace